### Panda Exercise

Write code for the questions below

In [1]:
import pandas as pd
df = pd.DataFrame({'Artist': ['Billie Holiday', 'Jimi Hendrix', 'Miles Davis', 'SIA'],
                   'Genre': ['Jazz', 'Rock', 'Jazz', 'Pop'],
                   'Listeners': [1300000, 2700000, 1500000, 2000000],
                   'Plays': [27000000, 70000000, 48000000, 74000000]})
df

           Artist Genre  Listeners     Plays
0  Billie Holiday  Jazz    1300000  27000000
1    Jimi Hendrix  Rock    2700000  70000000
2     Miles Davis  Jazz    1500000  48000000
3             SIA   Pop    2000000  74000000

Display for all columns and rows which has Listeners greater than 2000000

In [5]:
df[df["Listeners"] >= 2000000]

         Artist Genre  Listeners     Plays
1  Jimi Hendrix  Rock    2700000  70000000
3           SIA   Pop    2000000  74000000

Display Artist, Genre, Listeners and Plays columns which has Listeners greater than 2000000 and Plays greater than or equal to 70000000

In [6]:
df[(df["Listeners"] >= 2000000) & (df["Plays"] >= 70000000)]

         Artist Genre  Listeners     Plays
1  Jimi Hendrix  Rock    2700000  70000000
3           SIA   Pop    2000000  74000000

Display all from second to third row using iloc

In [7]:
df.iloc[1:3]

         Artist Genre  Listeners     Plays
1  Jimi Hendrix  Rock    2700000  70000000
2   Miles Davis  Jazz    1500000  48000000

Display Artist and Genre columns only which has Listeners greater than 2000000

In [8]:
df[df["Listeners"] >= 2000000][["Artist", "Genre"]]

         Artist Genre
1  Jimi Hendrix  Rock
3           SIA   Pop

Display all columns for the first row and third row using the index format (iloc)

In [9]:
df.iloc[[0, 2]]

           Artist Genre  Listeners     Plays
0  Billie Holiday  Jazz    1300000  27000000
2     Miles Davis  Jazz    1500000  48000000

Display the 2nd **and** 4th columns for the 1st row **and** 3rd row using the index format (iloc)

In [10]:
df.iloc[[0, 2], [1, 3]]

  Genre     Plays
0  Jazz  27000000
2  Jazz  48000000

Display the 2nd **to** 3rd columns for the 2nd row **to** 3rd row using the index format (iloc)

In [11]:
df.iloc[[1, 2], [1, 2]]

  Genre  Listeners
1  Rock    2700000
2  Jazz    1500000

Summarise of the numbers in the dataset

In [12]:
df.describe()

          Listeners         Plays
count  4.000000e+00  4.000000e+00
mean   1.875000e+06  5.475000e+07
std    6.238322e+05  2.174665e+07
min    1.300000e+06  2.700000e+07
25%    1.450000e+06  4.275000e+07
50%    1.750000e+06  5.900000e+07
75%    2.175000e+06  7.100000e+07
max    2.700000e+06  7.400000e+07

Print the columns

In [13]:
df.columns

Index(['Artist', 'Genre', 'Listeners', 'Plays'], dtype='object')

Display all rows for the first and third column using iloc

In [14]:
df.iloc[:, [0, 2]]

           Artist  Listeners
0  Billie Holiday    1300000
1    Jimi Hendrix    2700000
2     Miles Davis    1500000
3             SIA    2000000